{
  "cv": {
    "personalInfo": {
      "fullname": "Tuan Trinh Minh",
      "position": "Frontend Developer",
      "email": "tuantm.job@gmail.com",
      "phone": "0375227286",
      "linkedin": "https://www.linkedin.com/in/tuan-tm-3b68b32ba/"
    },
    "summary": {
      "0": "Frontend engineer with over 2 years of experience in developing applications using React and Next.js. Experienced in working on projects related to ecommerce, landing pages, and mobile, as well as controlling autonomous vehicles and unmanned aerial vehicles through communication with robot systems (ROS) using MQTT and Socket protocols for data processing. Also, nearly 1 year of experience in backend development with Node.js.",
      "1": "I am dedicated and serious about my work to create value for the company. I am also constantly exploring, learning, and improving my knowledge and skills to become a better engineer."
    },
    "skills": {
      "0": {
        "title": "Programming Languages",
        "details": "JavaScript (2+ years), TypeScript (1+ years)"
      },
      "1": {
        "title": "Database Management Systems",
        "details": "MongoDB, MySQL, PostgreSQL."
      },
      "2": {
        "title": "Frameworks/Platforms",
        "details": "NodeJS (Express), ReactJS, NextJS, Redis, Redux, React Native, WebSocket, MQTT, TailwindCSS, Bootstrap, .NET."
      },
      "3": {
        "title": "Version Control",
        "details": "Git."
      },
      "4": {
        "title": "IoT",
        "details": "MQTT, communication with ROS systems."
      },
      "5": {
        "title": "Operating Systems",
        "details": "Linux, Windows."
      },
      "6": {
        "title": "Other Tools",
        "details": "JIRA, Postman, Swagger, Figma."
      },
      "7": {
        "title": "Experience",
        "details": "Experience in designing and implementing RESTful APIs, familiar with Agile/Scrum development methodologies."
      }
    },
    "workExperience": {
      "0": {
        "company": {
          "name": "Phenikaa-X Company",
          "address": "Ha Dong, Ha Noi",
          "link": "https://phenikaa-x.com"
        },
        "job": {
          "position": "Full Stack Developer",
          "period": "03/2022 - 08/2024"
        },
        "project": {
          "0": {
            "title": "WebSite Phenikaa-X",
            "time": "09/2023 - 12/2023",
            "link": "https://phenikaa-x.com",
            "description": "The official website of Phenikaa-X, helping partners easily search for the company's products and get in touch.",
            "technologies": "ReactJs, Vite, Tailwindcss.",
            "responsibilities": {
              "0": "Develop and enhance the company's showcase website, ensuring a professional and user-friendly interface.",
              "1": "Optimize the website for smooth interactions across all devices and browsers.",
              "2": "Monitor and improve website performance, particularly page load speed and user experience.",
              "3": "Utilize Vite to streamline development processes and enhance project performance.",
              "4": "Integrate and optimize SEO to improve the website's search visibility.",
              "5": "Serve as the lead person responsible for managing and executing the project."
            }
          },
          "1": {
            "title": "Drone in a Box",
            "time": "01/2024 - 04/2024",
            "link": "#",
            "description": "Develop a comprehensive system for managing drones, maps, flight zones, flight plans, and automatic flight planning. The system uses WebSocket and Express for real-time communication, while MongoDB is used for data storage. The user interface is built with Next.js, Socket.io, and TailwindCSS, providing an interactive and responsive user experience.",
            "technologies": "Express, MongoDB, WebSocket, Cronjob, Next.js, Socket.io, TailwindCSS.",
            "responsibilities": {
              "0": "Design and build the overall system architecture, including front-end and back-end components.",
              "1": "Develop and maintain real-time communication between the server and drones using WebSocket, ensuring accurate data collection and processing.",
              "2": "Design MongoDB database schemas to manage data related to drones, flight zones, and flight plans.",
              "3": "Build back-end services using Express and Cronjob to automate flight planning processes and manage flight tasks.",
              "4": "Integrate and manage mapping services to visually display and manage flight zones and routes.",
              "5": "Develop the user interface with Next.js and TailwindCSS, optimizing the drone management experience for users.",
              "6": "Work closely with stakeholders to define and refine requirements, ensuring the system operates effectively and meets real-world needs."
            }
          },
          "2": {
            "title": "Training Center",
            "time": "04/2024 - 08/2024",
            "link": "https://ptc.phenikaax.com/",
            "description": "A project managing and showcasing four centers of Phenikaa University. Manages courses and instructors, course registrations, and credit exam registrations.",
            "technologies": "ReactJs, NextJs, NodeJs (ExpressJs), MongoDB, Tailwindcss, WebSocket.",
            "responsibilities": {
              "0": "Develop and enhance a website that aggregates information about the four centers, courses, instructors, and payment features.",
              "1": "Develop the project using Next.js, ShadUI, and TailwindCSS to create a modern, responsive user interface.",
              "2": "Use WebSocket to provide real-time payment updates to users.",
              "3": "Design and manage the database system, payment features, and synchronize instructor data.",
              "4": "Use WebSocket to notify users of successful payments.",
              "5": "Integrate Google and Microsoft authentication to allow easy user login.",
              "6": "Manage all courses, users, instructors, lessons, and centers.",
              "7": "Take primary responsibility for project implementation and management."
            }
          },
          "3": {
            "title": "AutoCar",
            "time": "03/2022 - 08/2022",
            "link": "https://phenet-smartcar.phenikaa-x.com/",
            "description": "Manage users, vehicles, and transmit information directly through MQTT and Socket.",
            "technologies": "NodeJs (Express), VueJs, MQTT, React Native, WebSocket.",
            "responsibilities": {
              "0": "Design and manage the system for user management, maps, and vehicle information.",
              "1": "Use JWT to securely authenticate user accounts.",
              "2": "Develop the first version of the mobile application.",
              "3": "Build modules for vehicle and map management on the server.",
              "4": "Develop modules for calculating travel distances and vehicle statistics.",
              "5": "Design the system for registering autonomous vehicle stops on the map.",
              "6": "Take primary responsibility for managing and executing the project."
            }
          },
          "4": {
            "title": "Semiconductor",
            "time": "09/2022 - 04/2023",
            "link": "https://semiconductor.phenikaa-uni.edu.vn/",
            "description": "The official website of the Semiconductor Center, helping partners easily search for the center's products and get in touch.",
            "technologies": "WordPress.",
            "responsibilities": {
              "0": "Customize the website interface using WordPress tools to modify colors, fonts, and layout.",
              "1": "Select and implement a theme from the WordPress library or from third-party providers.",
              "2": "Install and configure necessary plugins for the website.",
              "3": "Optimize page load speed using tools such as Google PageSpeed Insights.",
              "4": "Optimize content and website structure to improve SEO rankings.",
              "5": "Ensure the website performs well across all devices and browsers."
            }
          },
          "5": {
            "title": "Phenikaa Mec",
            "time": "05/2023 - 08/2023",
            "link": "https://mec.phenikaax.com/",
            "description": "The official website of the Semiconductor Hospital, helping partners easily find information about the hospital's products and schedule appointments.",
            "technologies": "WordPress, NextJS, Tailwindcss, WebSocket.",
            "responsibilities": {
              "0": "Customize the website interface using WordPress tools, including colors, fonts, and layout.",
              "1": "Select and implement a theme from the WordPress library or purchase from providers.",
              "2": "Develop appointment scheduling and doctor information lookup pages.",
              "3": "Install and configure necessary plugins according to project requirements.",
              "4": "Optimize page load speed and user experience using Google PageSpeed Insights.",
              "5": "Optimize SEO for pages and posts to enhance search visibility.",
              "6": "Ensure the website displays well across all devices and browsers."
            }
          }
        }
      },
      "1": {
        "company": {
          "name": "ITS Global Company",
          "address": "Mỹ Đình, Hà Nội",
          "link": "https://its-global.vn/"
        },
        "job": {
          "position": "Frontend Developer",
          "period": "10/2021 - 02/2022"
        },
        "project": {
          "0": {
            "title": "HR Solution",
            "time": "10/2021 - 02/2022",
            "link": "#",
            "description": "Develop and implement a comprehensive HR Solution system for the company, including employee information management, performance tracking, attendance, leave management, and payroll. The system ensures compliance with labor laws and integrates analytical tools to support strategic decisions and improve the working environment.",
            "technologies": "Express, React, Redux, MongoDB, WebSocket, Redis.",
            "responsibilities": {
              "0": "Build and develop the HR Solution system, including tracking and managing employee information, recruitment, and payroll.",
              "1": "Integrate features to evaluate employee performance and manage internal training programs.",
              "2": "Develop user interfaces to manage processes such as attendance, leave, and employment contracts easily.",
              "3": "Ensure the system meets data security requirements and complies with labor regulations.",
              "4": "Use analytical tools to monitor and report on human resources status, supporting the company's strategic decisions.",
              "5": "Integrate and manage employee feedback systems to improve the working environment and enhance employee satisfaction."
            }
          },
          "1": {
            "title": "Clothing Sales",
            "time": "10/2021 - 02/2022",
            "link": "#",
            "description": "Develop and implement an online sales system specializing in clothing, allowing users to browse products, add items to their cart, and securely complete purchases. The system integrates inventory management features, loyalty programs, and sales analytics to optimize the shopping experience and enhance customer engagement.",
            "technologies": "Express, React, Redux, MongoDB, WebSocket, Redis.",
            "responsibilities": {
              "0": "Build and develop the online payment system, ensuring security and convenience for users.",
              "1": "Integrate features for reward points and loyalty programs to encourage repeat purchases and customer retention.",
              "2": "Develop user interfaces to display clothing products in a visually appealing and user-friendly manner.",
              "3": "Monitor and optimize the payment process to minimize cart abandonment rates.",
              "4": "Integrate analytical and reporting tools to track customer shopping behavior and sales performance.",
              "5": "Ensure the website functions smoothly across all devices and browsers, providing the best shopping experience for users."
            }
          }
        }
      }
    },
    "education": {
      "university": {
        "name": "FPT Polytechnic College",
        "address": "Trinh Van Bo, Ha Noi"
      },
      "information": {
        "degree": "Major: Software application",
        "period": "10/2020 – 04/2023"
      }
    },
    "additionalInformation": {
      "0": "Languages: Vietnamese (Native), English"
    }
  },
  "settings": {
    "languages": {
      "title": "Choose languages",
      "vi": "Vietnamese",
      "en": "English"
    }
  },
  "system": {
    "CVHeaderTitle": {
      "summary": "Summary",
      "skills": "Technical skills",
      "experience": "Professional Expericence",
      "education": "Education",
      "additionalInformation": "Additional Information"
    },
    "CVWorkDetails": {
      "project": "Project",
      "description": "Description",
      "technologies": "Technologies",
      "responsibilities": "Responsibilities"
    },
    "personalInfo": {
      "email": "Email",
      "name": "Name",
      "phone": "Phone",
      "linkedin": "Linkedin"
    },
    "lastUpdate": "Last updated: 01/08/2024",
    "footer": {
      "intro": "Copyright © 2024 TuanTM",
      "view": "views"
    }
  },
  "app": {
    "name": "Tuan Trinh Minh",
    "content": "Tuan Trinh Minh",
    "info": {
      "hi": "Hello, I am Tuan Trinh"
    }
  }
}
